R1#show running-config
Building configuration...
Current configuration : 3195 bytes
!
hostname R1
interface Loopback1
 ip address 1.1.1.1 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 10.0.0.1 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 192.168.1.1 255.255.255.0
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 1
 network 1.0.0.0
 network 10.0.0.0
 network 192.168.1.0
!
!
ip route 0.0.0.0 0.0.0.0 10.0.0.2
!
line con 0
 logging synchronous
line aux 0
line vty 0
 logging synchronous
 login
 transport input none
line vty 1 4
 login
 transport input none
!
no scheduler allocate
!
end

------------------------------------------------------------------------------------------------

R2#show running-config
Current configuration : 3288 bytes
!
hostname R2
!
interface Loopback2
 ip address 2.2.2.2 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 10.0.0.2 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 11.0.0.1 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 1
 network 2.0.0.0
 network 10.0.0.0
!
router bgp 1
 bgp log-neighbor-changes
 network 192.168.1.0
 neighbor 5.5.5.5 remote-as 3
 neighbor 5.5.5.5 ebgp-multihop 2
 neighbor 5.5.5.5 update-source Loopback2
!
ip route 5.5.5.5 255.255.255.255 11.0.0.2
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

----------------------------------------------------------------------------------------------

R3#show running-config
Current configuration : 3134 bytes
!
hostname R3
!
interface Loopback3
 ip address 3.3.3.3 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 192.168.2.1 255.255.255.0
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 10.0.0.5 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 2
 network 3.0.0.0
 network 10.0.0.0
 network 192.168.2.0
!
ip route 0.0.0.0 0.0.0.0 10.0.0.6
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

----------------------------------------------------------------------------------------------

R4#show running-config
Current configuration : 3288 bytes
!
hostname R4
!
!
interface Loopback4
 ip address 4.4.4.4 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 11.0.0.5 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 10.0.0.6 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 2
 network 4.0.0.0
 network 10.0.0.0
!
router bgp 2
 bgp log-neighbor-changes
 network 192.168.2.0
 neighbor 5.5.5.5 remote-as 3
 neighbor 5.5.5.5 ebgp-multihop 2
 neighbor 5.5.5.5 update-source Loopback4
!
ip route 5.5.5.5 255.255.255.255 11.0.0.6
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

--------------------------------------------------------------------------------------------

R5#show running-config
Current configuration : 3529 bytes
!
hostname R5
!
interface Loopback5
 ip address 5.5.5.5 255.255.255.255
 ip ospf 1 area 0
!
interface GigabitEthernet0/0
 ip address 11.0.0.6 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 11.0.0.2 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/2
 ip address 12.0.0.1 255.255.255.252
 ip ospf 1 area 0
 duplex auto
 speed auto
 media-type rj45
!
!
router ospf 1
!
router bgp 3
 bgp log-neighbor-changes
 neighbor 2.2.2.2 remote-as 1
 neighbor 2.2.2.2 ebgp-multihop 2
 neighbor 2.2.2.2 update-source Loopback5
 neighbor 4.4.4.4 remote-as 2
 neighbor 4.4.4.4 ebgp-multihop 2
 neighbor 4.4.4.4 update-source Loopback5
 neighbor 6.6.6.6 remote-as 3
 neighbor 6.6.6.6 update-source Loopback5
 neighbor 6.6.6.6 next-hop-self
!
ip route 2.2.2.2 255.255.255.255 11.0.0.1
ip route 4.4.4.4 255.255.255.255 11.0.0.5
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

----------------------------------------------------------------------------------------------

R6#show running-config
Current configuration : 3361 bytes
!
!
hostname R6
!
!
interface Loopback6
 ip address 6.6.6.6 255.255.255.255
 ip ospf 1 area 0
!
interface GigabitEthernet0/0
 ip address 12.0.0.5 255.255.255.252
 ip ospf 1 area 0
 duplex auto
 speed auto
 media-type rj45
!
!
interface GigabitEthernet0/2
 ip address 12.0.0.2 255.255.255.252
 ip ospf 1 area 0
 duplex auto
 speed auto
 media-type rj45
!
!
router ospf 1
!
router bgp 3
 bgp log-neighbor-changes
 neighbor 5.5.5.5 remote-as 3
 neighbor 5.5.5.5 update-source Loopback6
 neighbor 5.5.5.5 route-reflector-client
 neighbor 7.7.7.7 remote-as 3
 neighbor 7.7.7.7 update-source Loopback6
 neighbor 7.7.7.7 route-reflector-client
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

----------------------------------------------------------------------------------------------

R7#show running-config
Current configuration : 3548 bytes
!
!
hostname R7
!
interface Loopback7
 ip address 7.7.7.7 255.255.255.255
 ip ospf 1 area 0
!
interface GigabitEthernet0/0
 ip address 12.0.0.6 255.255.255.252
 ip ospf 1 area 0
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 11.0.0.9 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/2
 ip address 11.0.0.13 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
router ospf 1
!
router bgp 3
 bgp log-neighbor-changes
 neighbor 6.6.6.6 remote-as 3
 neighbor 6.6.6.6 update-source Loopback7
 neighbor 6.6.6.6 next-hop-self
 neighbor 8.8.8.8 remote-as 4
 neighbor 8.8.8.8 ebgp-multihop 2
 neighbor 8.8.8.8 update-source Loopback7
 neighbor 10.10.10.10 remote-as 5
 neighbor 10.10.10.10 ebgp-multihop 2
 neighbor 10.10.10.10 update-source Loopback7
!
ip route 8.8.8.8 255.255.255.255 11.0.0.10
ip route 10.10.10.10 255.255.255.255 11.0.0.14
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

----------------------------------------------------------------------------------------------

R8#show running-config
Current configuration : 3289 bytes
!
!
hostname R8
!
!
interface Loopback8
 ip address 8.8.8.8 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 10.0.0.9 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 11.0.0.10 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 4
 network 8.0.0.0
 network 10.0.0.0
!
router bgp 4
 bgp log-neighbor-changes
 network 192.168.3.0
 neighbor 7.7.7.7 remote-as 3
 neighbor 7.7.7.7 ebgp-multihop 2
 neighbor 7.7.7.7 update-source Loopback8
!
ip route 7.7.7.7 255.255.255.255 11.0.0.9
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

-----------------------------------------------------------------------------------------------

R9#show running-config
Current configuration : 3060 bytes
!
!
hostname R9
!
!
interface GigabitEthernet0/0
 ip address 10.0.0.10 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 192.168.3.1 255.255.255.0
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 4
 network 10.0.0.0
 network 192.168.3.0
!
ip route 0.0.0.0 0.0.0.0 10.0.0.9
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

-------------------------------------------------------------------------------------------

R10#show running-config
Current configuration : 3281 bytes
!
!
hostname R10
!
!
interface Loopback10
 ip address 10.10.10.10 255.255.255.255
!
interface GigabitEthernet0/0
 ip address 10.0.0.13 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
interface GigabitEthernet0/2
 ip address 11.0.0.14 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
!
!
router eigrp 5
 network 10.0.0.0
!
router bgp 5
 bgp log-neighbor-changes
 network 192.168.4.0
 neighbor 7.7.7.7 remote-as 3
 neighbor 7.7.7.7 ebgp-multihop 2
 neighbor 7.7.7.7 update-source Loopback10
!
ip route 7.7.7.7 255.255.255.255 11.0.0.13
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end

-------------------------------------------------------------------------------------------------

R11#show running-config
Current configuration : 3062 bytes
!
!
hostname R11
!
!
interface GigabitEthernet0/0
 ip address 10.0.0.14 255.255.255.252
 duplex auto
 speed auto
 media-type rj45
!
interface GigabitEthernet0/1
 ip address 192.168.4.1 255.255.255.0
 duplex auto
 speed auto
 media-type rj45
!
!
router eigrp 5
 network 10.0.0.0
 network 192.168.4.0
!
ip route 0.0.0.0 0.0.0.0 10.0.0.13
!
!
line con 0
 logging synchronous
line aux 0
line vty 0 4
 login
 transport input none
!
no scheduler allocate
!
end
